using System;
using LogInfo;
using System.Xml;

namespace FinalExaminationWork
{
    class Program
    {
        static void Main(string[] args)
        {
           /* 
        Создать библиотеку для логирования информации.

        Должно поддерживаться логирование в форматах XML и JSON, но помимо этого требуется предоставить возможность другим разработчикам добавлять свои логеры.

        Логирование должно работать по следующим принципам:
         1.Логирование всегда осуществляется в файл, название которого имеет текущую дату и расширение .log
          2.Логируется следующая информация:
             а.Время
             б.Тип, который вызвал логгер
             в.Тип сообщения(ошибка, инфо, предупреждение)
             г.Само сообщение.
         3.Если файл уже существует - дописываем туда новую информацию*/       
        }
    }
}
